Repository: giellalt/corpus-fin
Catalog: tmx/sme/facta/giellatekno/index.fin.html.tmx
Source language: fin
Languages: sme

source: OAHPA-davvi voi toimia kielikurssien tai opetuksen apuneuvona.
sme: Bures boahtin OAHPA-davvi prográmmaide !

source: Se on myös osa kattavasta saamen kielen kurssista, vrt. http://kursa.oahpa.no (huom !, myös suomeksi, ks linkki Suoma kursa).
sme: OAHPA-davvi sáhttá geavahuvvot giellaoahppama veahkkereaidun, muhto lea maid dáid kurssaid oassin: http://kursa.oahpa.no.

source: Oahpa-ohjelmissa on monia vaihtoehtoja, ja niitä voidaan säätää eri tasoille.
sme: OAHPA-prográmmain leat ollu válljenvejolašvuođat ja sáhtát heivehit bargobihtáid ohppiide.

source: Olemme tehneet pienen oppaan jokaiselle ohjelmalle:
sme: Dás gávnnat bagadusa juohke prográmmii:

source: Numra - harjoitella lukusanoja
sme: Numra - hárjehallat loguid

source: Leksa - harjoitella sanoja ja paikannimiä
sme: Leksa - hárjehallat sániid ja báikenamaid

source: Morfa - taivuttaa sanoja, yksinään tai lauseyhteyksissä
sme: Morfa - hárjehallat sojahit sániid, juogo eaŋkilsániid dahje cealkagis

source: Vasta - vastaa kysymyksiin
sme: Vasta - vástidit jearaldagaide

source: Sahka - osallistua vuoropuheluun
sme: Sahka - ságastallamat

source: Tavoitteenamme on antaa oppilaille mahdollisuus harjoitella alkuopetuksessa käytettyä perussanastoa. Useimmissa ohjelmissa oppilaat voivat rajoittaa sanaston oppikirjansa mukaan.
sme: Min ulbmil lea ahte oahppit galget hárjehallat sániid mat leat dábálaččat álgooahpus, ja muhtun prográmmain sáhttá oahppi ráddjet sátnevuorkká dihto oahppogirjái.

source: Jos he mieluummin haluavat työskennellä tiettyjen teemojen kanssa, löytyy mahdoolisuus tulostaa teemasanalistoja.
sme: Jus oahpahusas lávebehtet bargat fáttáiguin, de sáhtát čálihit sátnelisttuid fáttáid mielde.

source: Olemme rakentaneet kieliopin, jossa jokainen sanaluokka selittyy taivutuksesimerkkien ja käyttöesimerkkien avulla.
sme: Mii leat ráhkadan minigrammatihka mas juohke sátneluohkká lea čilgejuvvon, ja gos leat sojahanminstarat.

source: Oppilaat löytävät kieliopin helposti OAHPA-ohjelman oikeassa yläkulmassa olevan valikon kautta.
sme: Oahppit besset grammatihkkii lásas mii lea bajit olgeš čiegas OAHPA-prográmmain.

source: Oppilaat voivat valita läntisen tai itäisen murteen.
sme: Oahppit sáhttet válljet juogo oarje- dahje nuortasuopmana.

source: Tämä tarkoittaa, että sanastoa, taivutusmuotoja ja selityksiä mukautetaan murrevalikoiman mukaan. Ohjelma rakentaa tehtävät murrevalikoiman mukaan, esim parittomien verbien preesensmuotojen yhteydessä: " mii muitalat " (Itä), " mii muitalit " (Länsi).
sme: Dát mielddisbuktá ahte sátnevuorká, sojahanminstarat ja čilgehusat heivehuvvojit válljejuvvon suopmanii, omd. bárahisstávvalvearbbat preseanssas: " mii muitalat " (nuortasuopman), " mii muitalit " (oarjesuopman).

source: Ohjelma hyväksyy kuitenkin kaikki oppilaiden annetut muodot, ovatko he mistä murteesta tahansa, kunhan ne noudattavat saamen virallista ortografiaa.
sme: Muhto prográmma dohkkeha buot riektačállima hámiid maid oahppi čállá, vaikko gulašii nuppi suopmanii.

source: Meillä on myös ohjelmia saamea osaaville oppilaille, jotka haluavat oppia lisää kielioppia ja syntaksi - VISL pelit - katso VISL-linkkiä oikealla.
sme: Mis leat maid prográmmat daidda geat juo máhttet sámegiela, muhto geat háliidit oahppat grámmatihka ja syntávssa - VISL-spealut - geahča gurut ravddas.

source: VISL-ohjelma Killerfiller sopii myös vasta-aloittaville opiskelijoille.
sme: Killerfiller heive gal oahpahalliide maid, danne go sáhttá válljet dási.

source: Linkki " Ressursit " tarjoaa sanakirjoja, sana- ja tekstianalyysia, mahdollisuuden rakentaa taivutusparadigmoja, sekä tietoa sanaluokista ja lausejäsenistä.
sme: Olgeš ravddas " Veahkkeneavvuid " vuolde, leat sojahanparadigmaid genereren, sátnegirji ja sátne- ja teakstaanalyseren, ja dieđut sátneluohkáid ja cealkkalahtuid birra.

source: Jotkin näistä lisäohjelmien vielä betaversiot, mikä merkitsee sitä, että niissä voi olla virheitä.
sme: Oassi min resurssain leat beta-veršuvnnat, ja dat máksá ahte sáhttet leat meattáhusat, ja maid ahte leat buoridanvejolašvuođat.

source: Kommentit ovat tervetulleita !
sme: Mii váldit áinnas vuostá kommentáraid !

source: Tekniset tiedot ja linkit
sme: Teknihkalaš spesifikašuvnnat ja liŋkkat

source: Tietoa hankkeesta
sme: Prošeavtta birra
